In [1]:
import pandas as pd

In [2]:
s = pd.Series(list('abcdef'))
s

0    a
1    b
2    c
3    d
4    e
5    f
dtype: object

In [5]:
s = pd.Series([2, 4, 6, 8])
s.index = ['f', 'a', 'c', 'e']
s

f    2
a    4
c    6
e    8
dtype: int64

In [6]:
s['f']

2

In [7]:
s[['c', 'e']]

c    6
e    8
dtype: int64

In [8]:
list('abab')

['a', 'b', 'a', 'b']

In [10]:
s2 = pd.Series(range(4), index=list('abab'))
s2

a    0
b    1
a    2
b    3
dtype: int64

In [11]:
s2['a']

a    0
a    2
dtype: int64

In [17]:
s

f    2
a    4
c    6
e    8
dtype: int64

In [18]:
s[s > 4]

c    6
e    8
dtype: int64

In [19]:
s > 4

f    False
a    False
c     True
e     True
dtype: bool

In [20]:
s*2

f     4
a     8
c    12
e    16
dtype: int64

In [3]:
dicionario = {'b': 100, 'c': 150, 'd': 200}
s = pd.Series(dicionario)
s

b    100
c    150
d    200
dtype: int64

In [4]:
s = pd.Series(dicionario, list('abcd'))
s

a      NaN
b    100.0
c    150.0
d    200.0
dtype: float64

In [5]:
s*2

a      NaN
b    200.0
c    300.0
d    400.0
dtype: float64

In [6]:
s2 = pd.Series([1, 2, 3], index=['c', 'b', 'a'])
s2

c    1
b    2
a    3
dtype: int64

In [7]:
s

a      NaN
b    100.0
c    150.0
d    200.0
dtype: float64

In [8]:
s*s2

a      NaN
b    200.0
c    150.0
d      NaN
dtype: float64

In [9]:
data = {'estado': ['PB', 'AL', 'SP', 'SP', 'SP'],
        'ano': [2010, 2011, 2008, 2010, 2011],
        'pop': [5.5, 4.5, 15.3, 15.6, 15.9]}
frame = pd.DataFrame(data)
frame

  estado   ano   pop
0     PB  2010   5.5
1     AL  2011   4.5
2     SP  2008  15.3
3     SP  2010  15.6
4     SP  2011  15.9

In [3]:
pop_data = {'PB': {2010: 5.5, 2011: 5.7},
            'SP': {2008: 15.5, 2010: 15.6, 2011: 15.9}}
pop = pd.DataFrame(pop_data)
pop

       PB    SP
2010  5.5  15.6
2011  5.7  15.9
2008  NaN  15.5

In [12]:
frame['estado']

0    PB
1    AL
2    SP
3    SP
4    SP
Name: estado, dtype: object

In [13]:
frame.estado

0    PB
1    AL
2    SP
3    SP
4    SP
Name: estado, dtype: object

In [15]:
frame.iloc[0]

estado      PB
ano       2010
pop        5.5
Name: 0, dtype: object

In [22]:
frame['outra'] = float('NaN')
frame

  estado   ano   pop  outra
0     PB  2010   5.5    NaN
1     AL  2011   4.5    NaN
2     SP  2008  15.3    NaN
3     SP  2010  15.6    NaN
4     SP  2011  15.9    NaN

In [21]:
frame.outra.dtype

dtype('float64')

In [23]:
frame['calc'] = frame['pop'] * 2
frame

  estado   ano   pop  outra  calc
0     PB  2010   5.5    NaN  11.0
1     AL  2011   4.5    NaN   9.0
2     SP  2008  15.3    NaN  30.6
3     SP  2010  15.6    NaN  31.2
4     SP  2011  15.9    NaN  31.8

In [25]:
obj = pd.Series(['azul', 'lilás', 'vermelho'], 
                index=[0, 2, 4])
obj

0        azul
2       lilás
4    vermelho
dtype: object

In [26]:
obj.reindex(range(4))

0     azul
1      NaN
2    lilás
3      NaN
dtype: object

In [27]:
obj.reindex(range(5), fill_value='preto')

0        azul
1       preto
2       lilás
3       preto
4    vermelho
dtype: object

In [28]:
obj.reindex(range(5), method='ffill')

0        azul
1        azul
2       lilás
3       lilás
4    vermelho
dtype: object

In [29]:
obj

0        azul
2       lilás
4    vermelho
dtype: object

In [4]:
pop

       PB    SP
2010  5.5  15.6
2011  5.7  15.9
2008  NaN  15.5

In [5]:
pop.sum()

PB    11.2
SP    47.0
dtype: float64

In [6]:
pop.mean()

PB     5.600000
SP    15.666667
dtype: float64

In [7]:
pop.describe()

             PB         SP
count  2.000000   3.000000
mean   5.600000  15.666667
std    0.141421   0.208167
min    5.500000  15.500000
25%    5.550000  15.550000
50%    5.600000  15.600000
75%    5.650000  15.750000
max    5.700000  15.900000

In [15]:
pop['PB'] == 5.5

2010     True
2011    False
2008    False
Name: PB, dtype: bool

In [13]:
pop[pop['PB'] == 5.5]

       PB    SP
2010  5.5  15.6